backend/views/layouts/main.php

$asset = backend\assets\AppAsset::register($this);

$user = Yii::$app->user->identity;
$userInfo = $user->profile->getResultInfo();
---
SELECT * FROM `user_profile` WHERE `user_id`=2